""""""

'''Екранирование'''
# Однострочный коментарий


print("good \nbay ")  # Перевод сторки
print("good \abay ")  # Звонок ???


a = 10       #int
print(a)

b = "srtoka" #str
print(b)

c = True     #bool
print(c)

d = 3.5      #float
print(d)

e = None     #Концепция ключевого слова None в том, что она дает переменной нейтральное или "нулевое" поведение
print(e)
print(type(None))  #<class 'NoneType'> в ооп
                   #Проверить на равенство None можно с помощью ключевого слова is.

"""
Битовые операции

x | y	Побитовое или
x ^ y	Побитовое исключающее или
x & y	Побитовое и
x << n	Битовый сдвиг влево
x >> y	Битовый сдвиг вправо
~x	Инверсия битов

"""